#pragma once 
#include <cmath>
#define EPS 1e-10

/*
Необходимо реализовать подсчет чисел фибоначчи с помощью шаблонного класса и функции во время компиляции

Поле класса, в котором хранится ответ value


Эталонная функция

int fibonacci(int x) {
   if((x==1)||(x==0)) {
      return(x);
   }else {
      return(fib(x-1)+fib(x-2));
   }
}

Пример подсчета для функции
fibonacci<4>()

Пример подсчета для класса
Fibonacci<4>::value

10 баллов
Перед сдачей необходимо создать pull reequest(назвать ветку своей фамилией), чтобы пройти тесты.

Дата последней сдачи 6.10.23 включительно
*/


auto fibonacci() -> T{

}


class Fibonacci{

};